Revit 2024 API
StairsRunStyle Enumeration
 The shape of a run. Different shape has different ways of manipulation.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum StairsRunStyle
Visual Basic
Public Enumeration StairsRunStyle
Visual C++
public enum class StairsRunStyle
Members
Member name | Description
Winder |  A winder run has distorted treads, for the sake of space saving at corner.
Sketched |  A sketched run can have customized boundary and riser curves. User can customize stair path as well.
Straight |  A straight run is defined by a straight line. All treads are rectangular.
Spiral |  A spiral run is defined by a cylindrical helix. Both inner and outer boundaries are arcs. Risers are straight lines.
See Also
Autodesk.Revit.DB.Architecture Namespace